app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @game = Game.find(params[:id])
    @game.board[params[:index].to_i] = @game.current_symbol
    @game.switch_user
    @game.save!
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "games" SET "board" = ?, "current_player" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["board", "---\n- X\n- 2\n- 3\n- 4\n- 5\n- 6\n- 7\n- 8\n- 9\n"], ["current_player", "Tanja"], ["updated_at", "2015-06-29 19:14:40.803950"], ["id", 4]]

  def create
    @game = Game.new(game_params)
    @game.board = (1..9).to_a
    @game.current_player = @game.player_1

    if @game.save
---
INSERT INTO "games" ("player_1", "player_2", "board", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["player_1", "Tanja"], ["player_2", "Nebojsa"], ["board", "[1, 2, 3, 4, 5, 6, 7, 8, 9]"], ["created_at", "2015-06-29 18:58:02.055896"], ["updated_at", "2015-06-29 18:58:02.055896"]]